# Лабораторная работа №13. Настройка NAT для IPv4

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_Preface.JPG)

# Цели:
## Часть 1. Создание сети и настройка основных параметров устройства
## Часть 2. Настройка и проверка NAT для IPv4
## Часть 3. Настройка и проверка PAT для IPv4
## Часть 4. Настройка и проверка статического NAT для IPv4

# Общие сведения и сценарий
Преобразование (NAT) — это процесс, при котором сетевое устройство, например маршрутизатор Cisco, назначает публичный адрес узлам в пределах частной сети. NAT используют для сокращения количества публичных IP-адресов, используемых организацией, поскольку количество доступных публичных IPv4-адресов ограничено.

Интернет-провайдер выделил компании общедоступное пространство IP-адресов 209.165.200.224/29. Эта сеть используется для обращения к каналу между маршрутизатором ISP (R2) и шлюзом компании (R1). Первый адрес (209.165.200.225) назначается интерфейсу g0/0 на R2, а последний адрес (209.165.200.230) назначается интерфейсу g0/0/0 на R1. Остальные адреса (209.165.200.226-209.165.200.229) будут использоваться для предоставления доступа в Интернет хостам компании. Маршрут по умолчанию используется от R1 до R2. Подключение интернет-провайдера к Интернету смоделировано loopback-адресом на маршрутизаторе интернет-провайдера.

В этой лабораторной работе будем настраивать различные типы NAT. Выполним тестирование, отображение и проверку осуществления всех преобразований и проанализируем статистику NAT/PAT для контроля процесса.

**Примечание:** Маршрутизаторы, используемые в практических лабораторных работах CCNA, - это Cisco 4221 с Cisco IOS XE Release 16.9.3 (образ universalk9). В лабораторных работах используются коммутаторы Cisco Catalyst 2960 с Cisco IOS версии 15.2(2) (образ lanbasek9). Можно использовать другие маршрутизаторы, коммутаторы и версии Cisco IOS. В зависимости от модели устройства и версии Cisco IOS доступные команды и результаты их выполнения могут отличаться от тех, которые показаны в лабораторных работах. Правильные идентификаторы интерфейса см. в сводной таблице по интерфейсам маршрутизаторов в конце лабораторной работы.

**Примечание:** Следует убедиться, что у всех маршрутизаторов и коммутаторов была удалена начальная конфигурация. 
# Необходимые ресурсы:
 - 2 маршрутизатора (Cisco 4221 с универсальным образом Cisco IOS XE версии 16.9.4 или аналогичным);
 - 2 коммутатора (Cisco 2960 с образом lanbasek9 Cisco IOS версии 15.2 (2) или аналогичным);
 - 2 ПК (ОС Windows с программой эмуляции терминалов, такой как Cisco Packet Tracer);
 - Консольные кабели для настройки устройств Cisco IOS через консольные порты;
 - Кабели Ethernet, расположенные в соответствии с топологией.
##
## Часть 1. Создание сети  настройка основных параметров устройства
Подключили устройства, как показано в топологии, и подсоединили необходимые кабели.
### Шаг 2. Произведение базовой настройки маршрутизаторов.
 - Назначение маршрутизатору имени устройства.
 - Назначение маршрутизатору имени устройства.
 - Отключение поиска DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введённые команды таким образом, как будто они являются именами узлов. 
 - Назначение **class** в качестве зашифрованного пароля привилегированного режима EXEC.
 - Назначение **cisco** в качестве пароля консоли и включение входа в систему по паролю.
 - Назначение **cisco** в качестве пароля VTY и включение входа в систему по паролю.
 - Шифрование открытых паролей.
 - Создание баннера с предупреждением о запрете несанкционированного доступа к устройству.
 - Настройка IP-адресации интерфейса как указано в таблице выше.
 - Настройка маршрута по умолчанию от R2 до  R1.
 - Сохранение текущей конфигурации в файл загрузочной конфигурации.

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_R12_basic_set.JPG)

### Шаг 3. Настройка базовых параметров каждого коммутатора.
 - Назначение коммутатору имени устройства.
 - Отключение поиска DNS, чтобы предотвратить попытки маршрутизатора неверно преобразовывать введённые команды таким образом, как будто они являются именами узлов. 
 - Назначение **class** в качестве зашифрованного пароля привилегированного режима EXEC.
 - Назначение **cisco** в качестве пароля консоли и включите вход в систему по паролю.
 - Назначение **cisco** в качестве пароля VTY и включение входа в систему по паролю.
 - Шифрование открытых паролей.
 - Создание баннера с предупреждением о запрете несанкционированного доступа к устройству.
 - Выключение всех интерфейсов, которые не будут использоваться.
 - Настройка IP-адресации интерфейса как указано в таблице выше.
 - Сохранение текущей конфигурации в файл загрузочной конфигурации.

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_S12_basic_set.JPG)

## Часть 2. Настройка и проверка NAT для IPv4
### Шаг 1. Настройка NAT на R1 при помощи пула из трёх адресов 209.165.200.226-209.165.200.228. 
 - Настройка простого списка доступа, который определяет, какие хосты будут разрешены для трансляции. В этом случае все устройства в локальной сети R1 имеют право на трансляцию.

R1(config)# access-list 1 permit 192.168.1.0 0.0.0.255
 - Создание пула NAT и указание ему имени и диапазона используемых адресов.

R1(config)# ip nat pool PUBLIC_ACCESS 209.165.200.226 209.165.200.228 netmask 255.255.255.248 
 - Настройка перевода, связывая ACL и пул с процессом преобразования.
 
R1(config)# ip nat inside source list 1 pool PUBLIC_ACCESS 

**Примечание:** Три очень важных момента. Во-первых, слово **«inside»** имеет решающее значение для работы такого рода NAT. Если опустить его, NAT не будет работать. Во-вторых, номер списка — это номер ACL, настроенный на предыдущем шаге. В-третьих, имя пула чувствительно к регистру.  
 - Задание внутреннего (inside) интерфейса.

R1(config)# interface g0/0/1

R1(config-if)# ip nat inside
 - Определение внешнего (outside) интерфейса.

R1(config)# interface g0/0/0

R1(config-if)# ip nat outside

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_R1_natset.JPG)

### Шаг 2. Проверка конфигурации.
 - С PC-B запуск эхо-запроса интерфейса Lo1 (209.165.200.1) на R2.
 
 ![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_PCB_pingLo1.JPG)
 
 - На R1 отображение таблицы NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations

Pro Inside global Inside local Outside local Outside global
--- 209.165.200.226 192.168.1.3 --- --- 
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1 
Total number of translations: 2

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_R1_nattable.JPG)

Во что был транслирован внутренний локальный адрес PC-B? - Во внутренний глобальный адрес 209.165.200.226.
 
Какой тип адреса NAT является переведенным адресом? - Внутренний глобальный адрес.

 - С PC-A запуск эхо-запроса интерфейса Lo1 (209.165.200.1) на R2.
 
![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_PCA_pingLoR2.JPG)
 
 - На R1 отображение таблицы NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations 
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.227 192.168.1.2 --- ---
--- 209.165.200.226 192.168.1.3 --- ---
227:1 192.168.1. 2:1 209.165.200. 1:1 209.165.200. 1:1
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1
Total number of translations: 4

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_IPnatR1.JPG)

 - Предыдущая трансляция для PC-B всё ещё находится в таблице. Из S1 следует отправить эхо-запрос интерфейса Lo1 (209.165.200.1) на R2.

![]()
  
 - На R1 следует отобразить таблицу NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.227 192.168.1.2 --- ---
--- 209.165.200.226 192.168.1.3 --- ---
--- 209.165.200.228 192.168.1.11 --- ---
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1
228:0 192.168.1. 11:0 209.165.200. 1:0 209.165.200. 1:0 209.165.200. 1:0
Total number of translations: 5 

![]()

 - Теперь нужно запустить пинг R2 Lo1 из S2. На этот раз перевод завершается неудачей, и мы получаем эти сообщения (или аналогичные) на консоли R1:

Sep 23 15:43:55.562: %IOSXE-6-PLATFORM: R0/0: cpp_cp: QFP:0.0 Thread:000 TS:00000001473688385900 %NAT-6-ADDR_ALLOC_FAILURE: Address allocation failed; pool 1 may be exhausted [2]
 - Это ожидаемый результат, потому что выделено только 3 адреса, и мы попытались ping Lo1 с четырех устройств. Напомним, что NAT — это трансляция «один-в-один». Как много выделено трансляций? Введите команду **show ip nat translations verbose**, и увидим, что ответ будет 24 часа.

R1# show ip nat translations verbose 
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.226 192.168.1.3 --- ---
  create: 09/23/19 15:35:27, use: 09/23/19 15:35:27, timeout: 23:56:42
  Map-Id(In): 1
<output omitted>

![]()

 - Учитывая, что пул ограничен тремя адресами, NAT для пула адресов недостаточно для нашего приложения. Очистим преобразование NAT и статистику, перейдём к PAT.

R1# clear ip nat translations * 
R1# clear ip nat statistics

![]()

## Часть 3. Настройка и проверка PAT для IPv4
В части 3 необходимо настроить замену NAT на PAT в пул адресов, а затем - на PAT с помощью интерфейса.
### Шаг 1. Удаление команды преобразования на R1.
Компоненты конфигурации преобразования адресов в основном одинаковы; что-то (список доступа) для идентификации адресов, пригодных для перевода, дополнительно настроенный пул адресов для их преобразования и команды, необходимые для идентификации внутреннего и внешнего интерфейсов. Из части 1 наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Мы будем использовать один и тот же пул адресов, поэтому нет необходимости воссоздавать эту конфигурацию. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу в части 3, удалим команду, связывающую ACL и пул вместе.

R1(config)# no ip nat inside source list 1 pool PUBLIC_ACCESS 

### Шаг 2. Добавление команды PAT на R1.
Теперь настроим преобразование PAT в пул адресов (ACL и Pool уже настроены, так что это единственная команда, которую нам нужно изменить с NAT на PAT).

R1(config)# ip nat inside source list 1 pool PUBLIC_ACCESS overload 

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_P4S1a2.JPG)

### Шаг 3. Тестирование и проверка конфигурации.
 - Проверим, что PAT работает. С PC-B запустили эхо-запрос интерфейса Lo1 (209.165.200.1) на R2.

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_P4S3_PCB.JPG)
 
 - На R1 отобразили таблицу NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
226:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1
Total number of translations: 1#

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_P4_S3_R1.JPG)

Вопросы:
Во что был транслирован внутренний локальный адрес PC-B?
 
Какой тип адреса NAT является переведенным адресом?

Чем отличаются выходные данные команды show ip nat translations из упражнения NAT?

 - С PC-A запустили эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отобразили таблицу NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
226:1 192.168.1. 2:1 209.165.200. 1:1 209.165.200. 1:1
Total number of translations: 1

![]()

Есть только одна трансляция. Отправили ping ещё раз, быстро вернулись к маршрутизатору и ввели команду **show ip nat translations verbose**.

R1# show ip nat translations verbose 
Pro Inside global Inside local Outside local Outside global
icmp 209.165.200.226:1 192.168.1.2:1 209.165.200.1:1 209.165.200.1:1 
  create: 09/23/19 16:57:22, use: 09/23/19 16:57:25, timeout: 00:01:00
<output omitted>

![]()

Можем увидеть, что время ожидания перевода было отменено с 24 часов до 1 минуты.

 - Сгенерируем трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используем параметр **-t** с командой **ping**, чтобы отправить безостановочный ping на интерфейс Lo1 R2 (ping -t 209.165.200.1), затем вернёмся к R1 и выполним команду **show ip nat translations**:

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
icmp 209.165.200.226:1 192.168.1.2:1 209.165.200.1:1 209.165.200.1:1 
226:2 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:2 
Total number of translations: 2 

![]()

Внутренний глобальный адрес одинаков для обоих сеансов. 

Вопрос:
Как маршрутизатор отслеживает, куда идут ответы? 
 - PAT в пул является очень эффективным решением для малых и средних организаций. Тем не менее, есть неиспользуемые адреса IPv4, задействованные в этом сценарии. Мы перейдем к PAT с перегрузкой интерфейса, чтобы устранить эту трату IPv4 адресов. Остановим ping на PC-A и PC-B с помощью комбинации клавиш **Control-C**, затем очистим трансляции и статистику:
   
R1# clear ip nat translations * 
R1# clear ip nat statistics 

![]()

### Шаг 4. Удаление команды преобразования nat pool на R1.
Наш список доступа (список доступа 1) по-прежнему корректен для сетевого сценария, поэтому нет необходимости воссоздавать его. Кроме того, внутренний и внешний интерфейсы не меняются. Чтобы начать работу с PAT к интерфейсу, очистим конфигурацию, удалив пул NAT и команду, связывающую ACL и пул вместе.

R1(config)# no ip nat inside source list 1 pool PUBLIC_ACCESS overload 
R1(config)# no ip nat pool PUBLIC_ACCESS

![]()

### Шаг 5. Добавление команды PAT overload, указав внешний интерфейс.
Добавим команду PAT, которая вызовет перегрузку внешнего интерфейса.

R1(config)# ip nat inside source list 1 interface g0/0/0 overload  

![]()

### Шаг 6. Тестирование и проверка конфигурации.
 - Проверим PAT, чтобы интерфейс работал. С PC-B запустим эхо-запрос интерфейса Lo1 (209.165.200.1) на R2. На R1 отобразим таблицу NAT на R1 с помощью команды **show ip nat translations**.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
209.165.200. 230:1 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:1 
Total number of translations: 1 

![]()

 - Сделаем трафик с нескольких устройств для наблюдения PAT. На PC-A и PC-B используем параметр **-t** с командой **ping** для отправки безостановочного ping на интерфейс Lo1 R2 (ping -t 209.165.200.1). На S1 и S2 выполним привилегированную команду **exec ping** 209.165.200.1 повторим 2000. Затем вернёмся к R1 и выполним команду **show ip nat translations**.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
209.165.200. 230:3 192.168.1. 11:1 209.165.200. 1:1 209.165.200. 1:3 
209.165.200. 230:2 192.168.1. 2:1 209.165.200. 1:1 209.165.200. 1:2 
209.165.200. 230:4 192.168.1. 3:1 209.165.200. 1:1 209.165.200. 1:4 
209.165.200. 230:1 192.168.1. 12:1 209.165.200. 1:1 209.165.200. 1:1 
Total number of translations: 4 

![]()

Теперь все внутренние глобальные адреса сопоставляются с IP-адресом интерфейса g0/0/0.

Остановим все пинги на PC-A и PC-B, используя комбинацию клавиш **CTRL-C**.

![]()

## Часть 4. Настройка и проверка статического NAT для IPv4
В части 4 будет настроена статическая NAT таким образом, чтобы PC-A был доступен напрямую из Интернета. PC-A будет доступен из R2 по адресу 209.165.200.229.

**Примечание**. Конфигурация, которую собираемся завершить, не соответствует рекомендуемым практикам для шлюзов, подключенных к Интернету. Эта лаборатория полностью опускает стандартные методы безопасности, чтобы сосредоточиться на успешной конфигурации статического NAT. В производственной среде решающее значение для удовлетворения этого требования будет иметь тщательная координация между сетевой инфраструктурой и группами безопасности. 

![]()

### Шаг 1. На R1 очистка текущих трансляций и статистики.
Откройте окно конфигурации
R1# clear ip nat translations * 
R1# clear ip nat statistics 

![]()

### Шаг2. На R1 настройка команды NAT, необходимой для статического сопоставления внутреннего адреса с внешним адресом.
Для этого шага настроим статическое сопоставление между 192.168.1.11 и 209.165.200.1 с помощью следующей команды:

R1(config)# ip nat inside source static 192.168.1.2 209.165.200.229 

![]()

### Шаг 3. Тестирование и проверка конфигурации.
 - Проверим, что статический NAT работает. На R1 отобразим таблицу NAT на R1 с помощью команды **show ip nat translations** и увидим статическое сопоставление.
   
R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.229 192.168.1.2 --- ---
Total number of translations: 1
 - Таблица перевода показывает, что статическое преобразование действует. Проверим это, запустив ping  с R2 на 209.165.200.229. Пинги должны работать.
**Примечание**. Возможно придётся отключить брандмауэр ПК для работы pings.

![]()

 - На R1 отобразим таблицу NAT на R1 с помощью команды **show ip nat translations** и увидим статическое сопоставление и преобразование на уровне порта для входящих pings.

R1# show ip nat translations
Pro Inside global Inside local Outside local Outside global
--- 209.165.200.229 192.168.1.2 --- ---
229:3 192.168.1. 2:3 209.165.200. 225:3 209.165.200. 225:3 209.165.200. 
Total number of translations: 2

![]()

Это подтверждает, что статический NAT работает.

![](https://github.com/IvShikov/OtusLab/blob/main/LAB13/Lab13_Table%20comparative.JPG)

**Примечание**. Чтобы определить конфигурацию маршрутизатора, можно посмотреть на интерфейсы, установить тип маршрутизатора и количество его интерфейсов. Перечислить все комбинации конфигураций для каждого класса маршрутизаторов невозможно. Эта таблица содержит идентификаторы для возможных комбинаций интерфейсов Ethernet и последовательных интерфейсов на устройстве. Другие типы интерфейсов в таблице не представлены, хотя они могут присутствовать в данном конкретном маршрутизаторе. В качестве примера можно привести интерфейс ISDN BRI. Строка в скобках — это официальное сокращение, которое можно использовать в командах Cisco IOS для обозначения интерфейса.
